class Card
  # создаем константы - массивы мастей и картинок
  SUITS = %i(Крестей Пик Бубей Червей)
  FACES  = %i(Двойка Тройка Четверка Пятерка Шестерка Семерка Восьмерка Девятка Десятка Валет Дама Король Туз)

  POINTS = {
    Двойка: 2, Тройка: 3, Четверка: 4, Пятерка: 5, Шестерка: 6, Семерка: 7, Восьмерка: 8, Девятка: 9,
    Десятка: 10, Валет: 10, Дама: 10, Король: 10, Туз: 11
    }
  attr_reader :face, :suit, :points

  def initialize(suit, face)
    @face = face
    @suit = suit
    @points = POINTS[face]
  end
end
